 #Задание: 
 # 1 Создать словарь из 10 студентов, поставить оценки (возможные оценки: 5, 4, 3) 
# 2 сколько парней 
# 3 посчитать средний бал успеваемости студента, и всей группы. 
# Задачи: 
# 1 создать функцию для ввода с клавиатуры (с входными параметрами : текст и тип вводимых данных. 
# 2 создать функцию для добавления словаря. 
# 3 создать картеж со списком: фамилия, имя, отчество, возраст, пол, номер группы, оценки. (ключи на латинице)
# 4 создать массив журнал (16 дат занятий)

def inp(text):
    print(text)

    
if __name__ == '__Main':
    inp(input)